<a href="https://colab.research.google.com/github/Shubzzz24/Goeduhub-Datascience-ML/blob/main/Task_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Task 5**
## **Reg ID : GO_STP_13238**
## **Name : Shubham Rohidas Hundare**
## **Date : 28/05/2021**

## Pandas - Data Analysis of IMDB movies data

# **1) Load the IMDb Dataset and read.**

In [ ]:
import numpy as np
import pandas as pd

df = pd.read_csv("/content/archive.zip")

# **2) View the dataset**

In [ ]:
df

     Rank                    Title  ... Revenue (Millions) Metascore
0       1  Guardians of the Galaxy  ...             333.13      76.0
1       2               Prometheus  ...             126.46      65.0
2       3                    Split  ...             138.12      62.0
3       4                     Sing  ...             270.32      59.0
4       5            Suicide Squad  ...             325.02      40.0
..    ...                      ...  ...                ...       ...
995   996     Secret in Their Eyes  ...                NaN      45.0
996   997          Hostel: Part II  ...              17.54      46.0
997   998   Step Up 2: The Streets  ...              58.01      50.0
998   999             Search Party  ...                NaN      22.0
999  1000               Nine Lives  ...              19.64      11.0

[1000 rows x 12 columns]

# **3)Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.**

In [ ]:
df.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [ ]:
df.shape

(1000, 12)

In [ ]:
df.size

12000

In [ ]:
df.head()

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0

[5 rows x 12 columns]

In [ ]:
df.tail()

     Rank                   Title  ... Revenue (Millions) Metascore
995   996    Secret in Their Eyes  ...                NaN      45.0
996   997         Hostel: Part II  ...              17.54      46.0
997   998  Step Up 2: The Streets  ...              58.01      50.0
998   999            Search Party  ...                NaN      22.0
999  1000              Nine Lives  ...              19.64      11.0

[5 rows x 12 columns]

In [ ]:
df.dtypes

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [ ]:
df.ndim

2

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [ ]:
df.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

In [ ]:
df['Rating']

0      8.1
1      7.0
2      7.3
3      7.2
4      6.2
      ...
995    6.2
996    5.5
997    6.2
998    5.6
999    5.3
Name: Rating, Length: 1000, dtype: float64

# **4) Data Selection – Indexing and Slicing data**

In [ ]:
df1 = df[df['Rating']>8].mean()
df1

Rank                     281.288136
Year                    2011.796610
Runtime (Minutes)        130.898305
Rating                     8.266102
Votes                 488015.491525
Revenue (Millions)       147.010182
Metascore                 77.796296
dtype: float64

# **5) Data Selection – Based on Conditional filtering**

In [ ]:
df[df['Runtime (Minutes)']<100]['Title']

7                     Mindhorn
15     The Secret Life of Pets
23                      Trolls
25             Paris pieds nus
27                  Dead Awake
                ...
994                  Project X
996            Hostel: Part II
997     Step Up 2: The Streets
998               Search Party
999                 Nine Lives
Name: Title, Length: 248, dtype: object

In [ ]:
df_fil = df.loc[df['Rating']>8.5,['Title','Director','Year','Rating','Votes']]
df_fil

                Title           Director  Year  Rating    Votes
36       Interstellar  Christopher Nolan  2014     8.6  1047747
54    The Dark Knight  Christopher Nolan  2008     9.0  1791916
80          Inception  Christopher Nolan  2010     8.8  1583625
96      Kimi no na wa     Makoto Shinkai  2016     8.6    34110
117            Dangal      Nitesh Tiwari  2016     8.8    48969
249  The Intouchables    Olivier Nakache  2011     8.6   557965

# **6) Groupby operations**

In [ ]:
df.groupby('Year')[['Rating','Revenue (Millions)']].mean()

        Rating  Revenue (Millions)
Year
2006  7.125000           86.296667
2007  7.133962           87.882245
2008  6.784615           99.082745
2009  6.960784          112.601277
2010  6.826667          105.081579
2011  6.838095           87.612258
2012  6.925000          107.973281
2013  6.812088           87.121818
2014  6.837755           85.078723
2015  6.602362           78.355044
2016  6.436700           54.690976

In [ ]:
df.groupby('Year')[["Year"]].count()

      Year
Year
2006    44
2007    53
2008    52
2009    51
2010    60
2011    63
2012    64
2013    91
2014    98
2015   127
2016   297

In [ ]:
df.groupby('Director')[['Rank']].count()

                     Rank
Director
Aamir Khan              1
Abdellatif Kechiche     1
Adam Leon               1
Adam McKay              4
Adam Shankman           2
...                   ...
Xavier Dolan            2
Yimou Zhang             1
Yorgos Lanthimos        2
Zack Snyder             5
Zackary Adler           1

[644 rows x 1 columns]

# **7) Sorting operation**

In [ ]:
df.sort_values(by='Year',ascending=False).head()

     Rank                               Title  ... Revenue (Millions) Metascore
999  1000                          Nine Lives  ...              19.64      11.0
161   162                           Free Fire  ...               1.80      63.0
647   648                            Tall Men  ...                NaN      57.0
234   235          The Huntsman: Winter's War  ...              47.95      35.0
653   654  Popstar: Never Stop Never Stopping  ...               9.39      68.0

[5 rows x 12 columns]

In [ ]:
df.sort_index(ascending=True).tail()

     Rank                   Title  ... Revenue (Millions) Metascore
995   996    Secret in Their Eyes  ...                NaN      45.0
996   997         Hostel: Part II  ...              17.54      46.0
997   998  Step Up 2: The Streets  ...              58.01      50.0
998   999            Search Party  ...                NaN      22.0
999  1000              Nine Lives  ...              19.64      11.0

[5 rows x 12 columns]

# **8) Dealling With missing Values**

In [ ]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

# **9) Dropping columns and null values**

In [ ]:
df.drop("Votes",axis=1,inplace=True)
df.head()

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0

[5 rows x 9 columns]

In [ ]:
df.dropna(inplace=True)

In [ ]:
df.isnull().sum()

Rank                  0
Title                 0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Revenue (Millions)    0
Metascore             0
dtype: int64

# **10) Apply Function**

In [ ]:
df[['Rating','Metascore','Revenue (Millions)']].agg(['min','max','mean'])

       Rating   Metascore  Revenue (Millions)
min   1.90000   11.000000            0.000000
max   9.00000  100.000000          936.630000
mean  6.81432   59.575179           84.564558